chore: use mermaid in doc diagrams
